Tekla.Structures.Drawing.IPlacing
The IPlacing interface is for objects that can have different placings.

Tekla.Structures.Drawing.IPlacing.Placing
The current placing of the object.
See Tekla.Structures.Drawing.PlacingTypes for different placing options.